#+TITLE: Chain Complexes
#+OPTIONS: toc:nil num:nil
#+PROPERTY: header-args :eval never-export :exports both :tangle yes  :results value verbatim

#+BEGIN_SRC lisp :exports none :results silent
(ql:quickload "kenzo")
(use-package :cat)
#+END_SRC

*** Examples

    #+BEGIN_SRC lisp
    (def comb1 (cmbn 1 1 'u 2 'v 3 'w 4 'z))
    #+END_SRC

    #+RESULTS:
    :
    : ----------------------------------------------------------------------{CMBN 1}
    : <1 * U>
    : <2 * V>
    : <3 * W>
    : <4 * Z>
    : ------------------------------------------------------------------------------

    #+BEGIN_SRC lisp
    (cmbn-non-zero-p comb1)
    #+END_SRC

    #+RESULTS:
    : T

    #+BEGIN_SRC lisp
    (cmbn-list comb1)
    #+END_SRC

    #+RESULTS:
    : ((1 . U) (2 . V) (3 . W) (4 . Z))

    #+BEGIN_SRC lisp
    (def term3 (third (cmbn-list comb1)))  ;; a simple cons!
    #+END_SRC

    #+RESULTS:
    : (3 . W)








[fn:1] *P.J. Giblin* in /Graph, Surface and Homology/, Chapman and Hall Math. series, 1981.
